# Intro to Pandas library
The pandas library contains two data types
- series
- dataFrames: a 2d object to represent `tabular` data

## Dataframe chars
- mutable
- index based
- a full class

## clasic data representation formats

-JSON
-CSV

In [21]:
import pandas as pd

In [22]:
#Create a new dataframe
df_one = pd.DataFrame(columns=['Column1', 'Column2'])
df_one

Empty DataFrame
Columns: [Column1, Column2]
Index: []

In [23]:
# another way
df_one.columns = ['First', 'Second']
df_one

Empty DataFrame
Columns: [First, Second]
Index: []

In [24]:
#add some rows
data1 = {
    'First':[1,3, 'real'], # key = column, values = list of data
    'Second':[2,7, 'imaginary']
}
df_two = pd.DataFrame(data1)
df_two

  First     Second
0     1          2
1     3          7
2  real  imaginary

In [25]:
#add data to dfOne
data_for = {
    'First': [66,77, 'Transiant'],
    'Second': [43,55, 'Pain']
}
df_one = pd.DataFrame(data_for)

In [26]:
# combine DFS
df_three = pd.concat([df_one, df_two])
df_three

       First     Second
0         66         43
1         77         55
2  Transiant       Pain
0          1          2
1          3          7
2       real  imaginary

In [27]:
#update indexs and combine them
df_three.reset_index(drop=True, inplace=True)
df_three

       First     Second
0         66         43
1         77         55
2  Transiant       Pain
3          1          2
4          3          7
5       real  imaginary

In [29]:
# add df column wise
col_data = {
    'Third': [80, 100, 11]
}
df_four = pd.DataFrame(col_data)
# now combine by column, add the axis = 1 param
df_combined = pd.concat([df_three, df_four], axis = 1)
df_combined

       First     Second  Third
0         66         43   80.0
1         77         55  100.0
2  Transiant       Pain   11.0
3          1          2    NaN
4          3          7    NaN
5       real  imaginary    NaN

## Task: Sales Data

In [35]:
#TODO: define a df callled df_sales, with two columns date and amount
df_sales = pd.DataFrame(columns=['Date', 'Amount'])
# add some sample data, three rows
sample_data = {
    'Date':['11/25', '9/9', '9/16'],
    'Amount':[5.0, 4.3, 90]
}
df_sales = pd.DataFrame(sample_data)
df_sales
#TODO: create a new df with two more rows of data, same columns as df_sales
sample_data2 = {
    'Date':['5/3', '4/29'],
    'Amount':[33,57]
}
df_new = pd.DataFrame(sample_data2)
#TODO: combine and ensure indexes are correst
df_sales_combined = pd.concat([df_sales, df_new])
df_sales_combined.reset_index(drop=True, inplace=True)
df_sales_combined
#TODO: add a new column called: Product with four rows of data and combine to original df
column_data = {
    'Product':['Apple', 'Carrots', 'Milk', 'Cheese', 'Bread']
}
df_new_col = pd.DataFrame(column_data)
df_final = pd.concat([df_sales_combined, df_new_col], axis =1)
df_final

    Date  Amount  Product
0  11/25     5.0    Apple
1    9/9     4.3  Carrots
2   9/16    90.0     Milk
3    5/3    33.0   Cheese
4   4/29    57.0    Bread